<section class="contact">
        <div class="contact-container">
            <h2 class="contact__title">Свяжитесь с нами</h2>
           <!-- <form class="contact-form" action="">
                <textarea class="contact-form__textarea"
                    name="contact-us"
                    placeholder="Опишите задачу..."
                    id="contact-us" rows="10"></textarea>
                <label class="contact-form__download">
                    <input
                        class="contact-form__download-file"
                        type="file"><svg width="21"
                        height="19" viewBox="0 0 21 19"
                        fill="none"
                        xmlns="http://www.w3.org/2000/svg">
                        <path
                            d="M19.4196 1.60486C17.3124 -0.534948 13.8957 -0.534957 11.7884 1.60486L1.1048 12.4537C-0.368266 13.9495 -0.368266 16.3822 1.1048 17.8781C2.57789 19.374 4.97355 19.374 6.44664 17.8781L17.1302 7.02926C17.9692 6.17737 17.9692 4.7815 17.1302 3.92961C16.2913 3.07768 14.9167 3.07768 14.0778 3.92959L4.92039 13.2286C4.86906 13.2792 4.82815 13.3397 4.80004 13.4065C4.77193 13.4733 4.75719 13.5451 4.75666 13.6177C4.75613 13.6904 4.76983 13.7624 4.79696 13.8296C4.82409 13.8968 4.86412 13.9579 4.9147 14.0093C4.96529 14.0607 5.02543 14.1013 5.09163 14.1289C5.15782 14.1564 5.22875 14.1703 5.30029 14.1698C5.37183 14.1692 5.44255 14.1543 5.50834 14.1257C5.57413 14.0972 5.63367 14.0556 5.6835 14.0035L14.8409 4.70451C15.2702 4.2685 15.9377 4.26849 16.3671 4.70451C16.7965 5.14052 16.7965 5.81834 16.3671 6.25434L5.68353 17.1032C4.62 18.1831 2.93147 18.1832 1.86793 17.1032C0.804428 16.0232 0.804401 14.3086 1.86793 13.2286L12.5515 2.37977C14.2492 0.655857 16.9588 0.655854 18.6565 2.37977C20.3541 4.10369 20.3542 6.85519 18.6565 8.5791L9.49907 17.8781C9.44784 17.9287 9.40703 17.9892 9.379 18.0559C9.35098 18.1227 9.33629 18.1945 9.33581 18.2671C9.33532 18.3397 9.34904 18.4116 9.37617 18.4788C9.4033 18.5459 9.4433 18.607 9.49385 18.6583C9.5444 18.7096 9.60448 18.7502 9.67062 18.7778C9.73675 18.8054 9.80762 18.8193 9.8791 18.8188C9.95058 18.8183 10.0213 18.8034 10.087 18.7749C10.1528 18.7465 10.2123 18.705 10.2622 18.653L19.4196 9.354C21.5268 7.2142 21.5268 3.74467 19.4196 1.60486Z"
                            fill="white" />
                    </svg>Прикрепите ТЗ</label>
                <label class="contact-form__download"><input
                        class="contact-form__download-img"
                        type="file" multiple
                        accept="image/*,image/jpeg"><svg
                        width="20" height="19"
                        viewBox="0 0 20 19" fill="none"
                        xmlns="http://www.w3.org/2000/svg">
                        <path fill-rule="evenodd"
                            clip-rule="evenodd"
                            d="M8 3.75C8 4.16421 7.66421 4.5 7.25 4.5L0.75 4.5C0.335786 4.5 2.93554e-08 4.16421 6.55671e-08 3.75C1.01779e-07 3.33579 0.335786 3 0.75 3L7.25 3C7.66421 3 8 3.33579 8 3.75Z"
                            fill="white" />
                        <path fill-rule="evenodd"
                            clip-rule="evenodd"
                            d="M-6.55668e-07 18L0 3L1.5 3L1.5 18L-6.55668e-07 18Z"
                            fill="white" />
                        <path fill-rule="evenodd"
                            clip-rule="evenodd"
                            d="M16 19H0V17.5H16V19Z"
                            fill="white" />
                        <path fill-rule="evenodd"
                            clip-rule="evenodd"
                            d="M15.25 19C14.8358 19 14.5 18.6642 14.5 18.25L14.5 11.75C14.5 11.3358 14.8358 11 15.25 11C15.6642 11 16 11.3358 16 11.75L16 18.25C16 18.6642 15.6642 19 15.25 19Z"
                            fill="white" />
                        <path fill-rule="evenodd"
                            clip-rule="evenodd"
                            d="M15.75 -3.27834e-08C16.1642 -1.46776e-08 16.5 0.335786 16.5 0.75L16.5 7.25C16.5 7.66421 16.1642 8 15.75 8C15.3358 8 15 7.66421 15 7.25L15 0.75C15 0.335786 15.3358 -5.08892e-08 15.75 -3.27834e-08Z"
                            fill="white" />
                        <path fill-rule="evenodd"
                            clip-rule="evenodd"
                            d="M20 3.75C20 4.16421 19.6642 4.5 19.25 4.5L12.75 4.5C12.3358 4.5 12 4.16421 12 3.75C12 3.33579 12.3358 3 12.75 3L19.25 3C19.6642 3 20 3.33579 20 3.75Z"
                            fill="white" />
                    </svg>Добавьте
                    фото товара</label>

                <button class="btn btn_white">Отправить
                    заявку</button>
            </form> !-->
        <?php echo do_shortcode ('[contact-form-7 id="35" title="Форма заказа"]');?>
        </div>
        <img class="contact-bg"
            src="<?php echo get_template_directory_uri(); ?>/img/backgrondForm.jpg" alt="">
    </section>