<?php
$args = array(
	'post_type' => 'employee',
);
?>
<?php $query = new WP_Query( $args );
?>
<?php if ( $query->have_posts() ) { ?>

    <section class="employee">
        <h2 class="employee__title">Сотрудники компании</h2>
        <ul class="employee__list">
        <?php while ( $query->have_posts() ) {
		$query->the_post();
		 ?>
         <li class="employee__list-item item">
                <div class="line line_green"></div>
                <div
                    class="employee__list-item item-description">
                    <img class="employee__list-item item-description__img"
                        src="<?php echo get_field('dlya_sotrudnikov'); ?>"
                        alt="фото">
                    <div
                        class="employee__list-item item-description__container">
                        <p class="name"><?php the_title() ?></p>
                        <p class="post"><?php echo get_the_content();?>
                        </p>

                        
                        
                        <div class="social"> 
                        <?php if (get_field('instagram')){ ?>
                            <a class="social__link"
                                href=" <?php echo get_field('instagram'); ?> ">
                                <svg width="20" height="20"
                                    viewBox="0 0 20 20"
                                    fill="none"
                                    xmlns="http://www.w3.org/2000/svg">
                                    <path
                                        d="M14.5862 0H5.41382C2.42859 0 0 2.42859 0 5.41382V14.5863C0 17.5714 2.42859 20 5.41382 20H14.5863C17.5714 20 20 17.5714 20 14.5863V5.41382C20 2.42859 17.5714 0 14.5862 0V0ZM10 15.4686C6.98456 15.4686 4.5314 13.0154 4.5314 10C4.5314 6.98456 6.98456 4.5314 10 4.5314C13.0154 4.5314 15.4686 6.98456 15.4686 10C15.4686 13.0154 13.0154 15.4686 10 15.4686ZM15.5994 5.82108C14.7083 5.82108 13.9835 5.09628 13.9835 4.20517C13.9835 3.31406 14.7083 2.58911 15.5994 2.58911C16.4905 2.58911 17.2154 3.31406 17.2154 4.20517C17.2154 5.09628 16.4905 5.82108 15.5994 5.82108Z"
                                        fill="#BFBFC7" />
                                </svg>

                            </a>
                            <?php } ?>
                            <?php if (get_field('vk')){ ?>
                            <a class="social__link"
                                href="<?php echo get_field('vk'); ?>">
                                <svg width="29" height="17"
                                    viewBox="0 0 29 17"
                                    fill="none"
                                    xmlns="http://www.w3.org/2000/svg">
                                    <path
                                        d="M24.0648 9.74829C23.5959 9.15329 23.7301 8.88857 24.0648 8.35671C24.0708 8.35064 27.9413 2.97621 28.34 1.15357L28.3424 1.15236C28.5406 0.488143 28.3424 0 27.3842 0H24.2134C23.4062 0 23.034 0.418929 22.8347 0.887643C22.8347 0.887643 21.2203 4.77093 18.9364 7.28814C18.1993 8.0155 17.8586 8.24864 17.4562 8.24864C17.258 8.24864 16.9499 8.0155 16.9499 7.35129V1.15236C16.9499 0.355786 16.7239 0 16.0557 0H11.0699C10.5636 0 10.2627 0.371572 10.2627 0.717643C10.2627 1.47293 11.4046 1.64657 11.5231 3.77157V8.38221C11.5231 9.3925 11.3406 9.57829 10.9358 9.57829C9.85793 9.57829 7.24179 5.67921 5.69145 1.21671C5.37848 0.350928 5.07276 0.0012142 4.25952 0.0012142H1.08754C0.182465 0.0012142 0 0.420143 0 0.888857C0 1.717 1.07787 5.83464 5.01234 11.2746C7.63451 14.9879 11.3273 17 14.6866 17C16.7058 17 16.9523 16.5531 16.9523 15.7845C16.9523 12.2364 16.7698 11.9012 17.7812 11.9012C18.2501 11.9012 19.0573 12.1344 20.9424 13.9254C23.0969 16.0492 23.4509 17 24.6569 17H27.8277C28.7315 17 29.1895 16.5531 28.9261 15.6716C28.3231 13.8174 24.2485 10.0033 24.0648 9.74829Z"
                                        fill="#BFBFC7" />
                                </svg>
                            </a>
                            <?php } ?>
                            <?php if (get_field('fejsbuk')){ ?>
                            <a class="social__link"
                                href="<?php echo get_field('fejsbuk'); ?>"><svg width="20"
                                    height="20"
                                    viewBox="0 0 20 20"
                                    fill="none"
                                    xmlns="http://www.w3.org/2000/svg">
                                    <path
                                        d="M19.9952 20V19.9992H20.0001V12.7841C20.0001 9.25439 19.2326 6.5354 15.0647 6.5354C13.061 6.5354 11.7164 7.62398 11.1675 8.656H11.1095V6.86493H7.15771V19.9992H11.2727V13.4956C11.2727 11.7832 11.6005 10.1274 13.7424 10.1274C15.8529 10.1274 15.8844 12.0816 15.8844 13.6054V20H19.9952Z"
                                        fill="#BFBFC7" />
                                    <path
                                        d="M0.327881 6.86499H4.44778V19.9993H0.327881V6.86499Z"
                                        fill="#BFBFC7" />
                                    <path
                                        d="M2.38617 0C1.06889 0 0 1.05825 0 2.36241C0 3.66658 1.06889 4.74696 2.38617 4.74696C3.70344 4.74696 4.77233 3.66658 4.77233 2.36241C4.7715 1.05825 3.70261 0 2.38617 0V0Z"
                                        fill="#BFBFC7" />
                                </svg></a>
                                <?php } ?>
                        </div>
                    </div>
                </div>

            </li>
            <? }
        ?>

        </ul>
    </section>
    <?php } ?>

<?php  // Возвращаем оригинальные данные поста. Сбрасываем $post.
wp_reset_postdata(); ?>