const cardsCollection = [
    {
        img: 'cardImg/1.png',
        title: 'Устрицы по рокфеллеровски',
        description: 'Значимость этих проблем настолько очевидна, что укрепление и развитие структуры',
        price: 2700,
        wight: 500,
    },
    {
        img: 'cardImg/2.png',
        title: 'Свиные ребрышки на гриле с зеленью',
        description: 'Не следует, однако забывать, что реализация намеченных плановых',
        price: 1600,
        wight: 750,
    },
    {
        img: 'cardImg/3.png',
        title: 'Креветки по-королевски в лимонном соке',
        description: 'Значимость этих проблем настолько очевидна, что укрепление и развитие структуры обеспечивает широкому кругу',
        price: 1820,
        wight: 450,
    },
    {
        img: 'cardImg/4.png',
        title: 'Устрицы по рокфеллеровски',
        description: 'Значимость этих проблем настолько очевидна, что укрепление и развитие структуры',
        price: 2700,
        wight: 500,
    },
    {
        img: 'cardImg/1.png',
        title: 'Устрицы по рокфеллеровски',
        description: 'Значимость этих проблем настолько очевидна, что укрепление и развитие структуры',
        price: 2700,
        wight: 500,
    },
    {
        img: 'cardImg/2.png',
        title: 'Свиные ребрышки на гриле с зеленью',
        description: 'Не следует, однако забывать, что реализация намеченных плановых',
        price: 1600,
        wight: 750,
    },
    {
        img: 'cardImg/3.png',
        title: 'Креветки по-королевски в лимонном соке',
        description: 'Значимость этих проблем настолько очевидна, что укрепление и развитие структуры обеспечивает широкому кругу',
        price: 1820,
        wight: 450,
    },
    {
        img: 'cardImg/4.png',
        title: 'Устрицы по рокфеллеровски',
        description: 'Значимость этих проблем настолько очевидна, что укрепление и развитие структуры',
        price: 2700,
        wight: 500,
    },
]

export default cardsCollection